use 5.016;
use warnings;
use Data::Dumper;
open pci_device, "list.txt";
#Регексп, я вызываю тебя!
my %dev;
my $i = 0; my %cnt;
foreach (<pci_device>) {
	chomp; 
	s/^"(.*)"$/$1/; 
	my @a = split '\",\"';
	#Корректировка значений списка
	#Я буду только дописывать нули слева там где их нехватает. Остальные косяки просто пропущу
	$a[0] =~ s/^0x([0-9A-Fa-f]{4})/$1/;
	if(!($a[1] =~ /^0(x|X)([0-9A-Fa-f]{4}$)/)) {
		if($a[1] =~ /^0x([0-9a-f]{3}$)/i) {
			$a[1] =~ s/^0x(?<id>[0-9a-f]{3}$)/0$+{id}/i;
		} elsif($a[1] =~ /^0x([0-9a-f]{2}$)/i) {
			$a[1] =~ s/^0x(?<id>[0-9a-f]{2}$)/00$+{id}/i;
		} elsif($a[1] =~ /^0x([0-9a-f]{1}$)/i) {
			$a[1] =~ s/^0x(?<id>[0-9a-f]{1}$)/000$+{id}/i;
		} else { next }
	}
	$dev{$a[0]}{$a[1]} = $a[2].$a[3].$a[4];
	# print $a[0]." -> ";
	# print $a[1]." -> ";
	# say $dev{$a[0]}{$a[1]};
}
#Хэш массивов хэшей?
